___

<a href='https://mp.weixin.qq.com/mp/appmsgalbum?__biz=Mzg2OTU4NzI3NQ==&action=getalbum&album_id=1764511202329624577&scene=126#wechat_redirect'> <img src=../../../../pic/project_logo.jpg></a>
___

# DataFrames

DataFrames 是 pandas 的核心，受到了 R 编程语言的启发。


我们可以将 DataFrame 视为一堆 Series 对象放在一起以共享相同的索引。

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(2022)

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A -0.000528 -0.274901 -0.139286  1.984686
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813 -0.090213 -2.305943
D  1.142760 -1.535654 -0.863752  1.016545
E  1.033964 -0.824492  0.018905 -0.383344

## 筛选&索引

学习从 DataFrame 中获取数据的各种方法

In [5]:
df['W']

A   -0.000528
B    0.282109
C    0.373497
D    1.142760
E    1.033964
Name: W, dtype: float64

In [6]:
# 传如列表形式的列名
df[['W','Z']]

          W         Z
A -0.000528  1.984686
B  0.282109  0.540297
C  0.373497 -2.305943
D  1.142760  1.016545
E  1.033964 -0.383344

In [7]:
# SQL 语法（不推荐！）
df.W

A   -0.000528
B    0.282109
C    0.373497
D    1.142760
E    1.033964
Name: W, dtype: float64

DataFrame 的列就是系列

In [8]:
type(df['W'])

pandas.core.series.Series

** 产生一个新的列 **

In [9]:
df['new'] = df['W'] + df['Y']

In [10]:
df

          W         X         Y         Z       new
A -0.000528 -0.274901 -0.139286  1.984686 -0.139813
B  0.282109  0.760809  0.300982  0.540297  0.583091
C  0.373497  0.377813 -0.090213 -2.305943  0.283284
D  1.142760 -1.535654 -0.863752  1.016545  0.279008
E  1.033964 -0.824492  0.018905 -0.383344  1.052869

<div class="alert alert-block alert-info">其他方式：

- assign
- insert

</div>

In [12]:
df1 = df.copy()


# assign
df1.assign(new1 = [1,2,3,4,5])

print("Dataframe after adding new column using 【assign】:")

df1

df1.insert(1, "new2", [6,7,8,9,0])

print("Dataframe after adding new column using 【insert】 at a particular position:")

df1

Dataframe after adding new column using 【assign】:
Dataframe after adding new column using 【insert】 at a particular position:

          W  new2         X         Y         Z       new
A -0.000528     6 -0.274901 -0.139286  1.984686 -0.139813
B  0.282109     7  0.760809  0.300982  0.540297  0.583091
C  0.373497     8  0.377813 -0.090213 -2.305943  0.283284
D  1.142760     9 -1.535654 -0.863752  1.016545  0.279008
E  1.033964     0 -0.824492  0.018905 -0.383344  1.052869

** 移除列 **

In [13]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.000528 -0.274901 -0.139286  1.984686
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813 -0.090213 -2.305943
D  1.142760 -1.535654 -0.863752  1.016545
E  1.033964 -0.824492  0.018905 -0.383344

In [14]:
# 除非有说明，否则不就地操作
df

          W         X         Y         Z       new
A -0.000528 -0.274901 -0.139286  1.984686 -0.139813
B  0.282109  0.760809  0.300982  0.540297  0.583091
C  0.373497  0.377813 -0.090213 -2.305943  0.283284
D  1.142760 -1.535654 -0.863752  1.016545  0.279008
E  1.033964 -0.824492  0.018905 -0.383344  1.052869

In [15]:
df.drop('new',axis=1,inplace=True)

In [16]:
df

          W         X         Y         Z
A -0.000528 -0.274901 -0.139286  1.984686
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813 -0.090213 -2.305943
D  1.142760 -1.535654 -0.863752  1.016545
E  1.033964 -0.824492  0.018905 -0.383344

也可以这样删除行：

In [17]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.000528 -0.274901 -0.139286  1.984686
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813 -0.090213 -2.305943
D  1.142760 -1.535654 -0.863752  1.016545

** 选择行 **

In [18]:
df.loc['A']

W   -0.000528
X   -0.274901
Y   -0.139286
Z    1.984686
Name: A, dtype: float64

或根据位置而不是标签选择（select based off of position instead of label）

In [19]:
df.iloc[2]

W    0.373497
X    0.377813
Y   -0.090213
Z   -2.305943
Name: C, dtype: float64

** 选择行和列的子集 **

In [20]:
df.loc['B','Y']

0.30098160612635816

In [21]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.000528 -0.139286
B  0.282109  0.300982

### 条件筛选

pandas 的一个重要特性是使用中括号表示法进行条件筛选，与 numpy 非常相似：

In [22]:
df

          W         X         Y         Z
A -0.000528 -0.274901 -0.139286  1.984686
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813 -0.090213 -2.305943
D  1.142760 -1.535654 -0.863752  1.016545
E  1.033964 -0.824492  0.018905 -0.383344

In [23]:
df>0

       W      X      Y      Z
A  False  False  False   True
B   True   True   True   True
C   True   True  False  False
D   True  False  False   True
E   True  False   True  False

In [24]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  1.984686
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813       NaN       NaN
D  1.142760       NaN       NaN  1.016545
E  1.033964       NaN  0.018905       NaN

In [25]:
df[df['W']>0]

          W         X         Y         Z
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813 -0.090213 -2.305943
D  1.142760 -1.535654 -0.863752  1.016545
E  1.033964 -0.824492  0.018905 -0.383344

In [26]:
df[df['W']>0]['Y']

B    0.300982
C   -0.090213
D   -0.863752
E    0.018905
Name: Y, dtype: float64

In [27]:
df[df['W']>0][['Y','X']]

          Y         X
B  0.300982  0.760809
C -0.090213  0.377813
D -0.863752 -1.535654
E  0.018905 -0.824492

For two conditions you can use | and & with parenthesis:

In [27]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## 更多索引详情

关于索引的更多功能，包括重置索引或设置其他内容。

后续还将讨论索引层次结构！

In [28]:
df

          W         X         Y         Z
A -0.000528 -0.274901 -0.139286  1.984686
B  0.282109  0.760809  0.300982  0.540297
C  0.373497  0.377813 -0.090213 -2.305943
D  1.142760 -1.535654 -0.863752  1.016545
E  1.033964 -0.824492  0.018905 -0.383344

In [29]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.000528 -0.274901 -0.139286  1.984686
1     B  0.282109  0.760809  0.300982  0.540297
2     C  0.373497  0.377813 -0.090213 -2.305943
3     D  1.142760 -1.535654 -0.863752  1.016545
4     E  1.033964 -0.824492  0.018905 -0.383344

In [30]:
new_col = '中国 美国 英国 新加坡 澳大利亚'.split()

In [31]:
df['Country'] = new_col

In [32]:
df

          W         X         Y         Z Country
A -0.000528 -0.274901 -0.139286  1.984686      中国
B  0.282109  0.760809  0.300982  0.540297      美国
C  0.373497  0.377813 -0.090213 -2.305943      英国
D  1.142760 -1.535654 -0.863752  1.016545     新加坡
E  1.033964 -0.824492  0.018905 -0.383344    澳大利亚

In [33]:
df.set_index('Country')

                W         X         Y         Z
Country
中国      -0.000528 -0.274901 -0.139286  1.984686
美国       0.282109  0.760809  0.300982  0.540297
英国       0.373497  0.377813 -0.090213 -2.305943
新加坡      1.142760 -1.535654 -0.863752  1.016545
澳大利亚     1.033964 -0.824492  0.018905 -0.383344

In [34]:
df

          W         X         Y         Z Country
A -0.000528 -0.274901 -0.139286  1.984686      中国
B  0.282109  0.760809  0.300982  0.540297      美国
C  0.373497  0.377813 -0.090213 -2.305943      英国
D  1.142760 -1.535654 -0.863752  1.016545     新加坡
E  1.033964 -0.824492  0.018905 -0.383344    澳大利亚

In [35]:
df.set_index('Country',inplace=True)

# When inplace = True , the data is modified in place, which means it will return nothing and the dataframe is now updated

In [36]:
df

                W         X         Y         Z
Country
中国      -0.000528 -0.274901 -0.139286  1.984686
美国       0.282109  0.760809  0.300982  0.540297
英国       0.373497  0.377813 -0.090213 -2.305943
新加坡      1.142760 -1.535654 -0.863752  1.016545
澳大利亚     1.033964 -0.824492  0.018905 -0.383344

## 多重索引和索引层次结构

In [37]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

# used to convert list of tuples to MultiIndex

In [38]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [39]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.304185  0.997292
   2 -0.127274 -1.475886
   3 -1.940906  0.833649
G2 1 -0.567218  1.174487
   2  0.319069  0.190870
   3  0.369270 -0.101148

对于索引层次结构，我们使用 `df.loc[]`，如果它位于列轴上，则只需使用普通括号表示法 `df[]`。调用一级索引返回子数据帧：

In [40]:
df.loc['G1']

          A         B
1 -0.304185  0.997292
2 -0.127274 -1.475886
3 -1.940906  0.833649

In [41]:
df.loc['G1'].loc[1]

A   -0.304185
B    0.997292
Name: 1, dtype: float64

In [42]:
df.index.names

FrozenList([None, None])

In [43]:
df.index.names = ['Group','Num']

In [44]:
df

                  A         B
Group Num
G1    1   -0.304185  0.997292
      2   -0.127274 -1.475886
      3   -1.940906  0.833649
G2    1   -0.567218  1.174487
      2    0.319069  0.190870
      3    0.369270 -0.101148

df.xs()官方文档：

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.xs.html

In [45]:
df.xs('G1')

# .xs() - return a cross-section from the Series/DataFrame for the given key value

            A         B
Num
1   -0.304185  0.997292
2   -0.127274 -1.475886
3   -1.940906  0.833649

In [46]:
df.xs(('G1',1)) # pass key as a tuple

A   -0.304185
B    0.997292
Name: (G1, 1), dtype: float64

In [47]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.304185  0.997292
G2    -0.567218  1.174487

# Great Job!